app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-10-04 11:10:30.443773"], ["updated_at", "2019-10-04 11:10:30.443773"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 3], ["cart_id", 1], ["created_at", "2019-10-04 12:41:42.093567"], ["updated_at", "2019-10-04 12:41:42.093567"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2019-10-04 12:41:09.819107"], ["id", 1]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    # @line_item = @cart.line_items.build(product: product)
    #This causes a new line item relationship to
    #be built between the @cart object and the product.
    #@line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save