app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.all

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 35]]
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 33], ["LIMIT", 1]]
---
  def new
    if @cart.line_items.empty?

INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "nameAAA"], ["address", "adressAAA"], ["email", "AAAA@a.a"], ["pay_type", "Check"], ["created_at", "2019-10-08 12:01:23.329890"], ["updated_at", "2019-10-08 12:01:23.329890"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_order
      @order = Order.find(params[:id])