app/controllers/concerns/current_cart.rb

		def set_cart
			@cart = Cart.find(session[:cart_id])
		rescue ActiveRecord::RecordNotFound
			@cart = Cart.create
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-10-04 11:10:30.443773"], ["updated_at", "2019-10-04 11:10:30.443773"]]